validation/conventional/squareCylinder/RANS/2D/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     	pimpleFoam;

startFrom       	startTime;

startTime       	0;

stopAt          	endTime;

endTime         	50;

deltaT          	0.0001;

writeControl    	adjustableRunTime;

writeInterval   	0.01;

purgeWrite      	0;

writeFormat     	ascii;

writePrecision		8;

writeCompression	off;

timeFormat      	general;

timePrecision   	8;

runTimeModifiable	yes;

adjustTimeStep		yes;

maxCo           	0.9;

maxDeltaT       	0.01;

functions
{
	#includeFunc	fieldAverage(U, p, prime2Mean=yes)
	#includeFunc	one_component_sampling
	#includeFunc	two_component_sampling
}

// ************************************************************************* //
